; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=336, out_folder=./training, instance_id=72, seed=2096, goal_proportion=0.03

(define (problem blocksworld-72)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 b271 b272 b273 b274 b275 b276 b277 b278 b279 b280 b281 b282 b283 b284 b285 b286 b287 b288 b289 b290 b291 b292 b293 b294 b295 b296 b297 b298 b299 b300 b301 b302 b303 b304 b305 b306 b307 b308 b309 b310 b311 b312 b313 b314 b315 b316 b317 b318 b319 b320 b321 b322 b323 b324 b325 b326 b327 b328 b329 b330 b331 b332 b333 b334 b335 b336 - object)
 (:init 
    (arm-empty)
    (clear b313)
    (on-table b313)
    (clear b279)
    (on b279 b125)
    (on b125 b168)
    (on b168 b212)
    (on b212 b325)
    (on b325 b311)
    (on b311 b53)
    (on b53 b29)
    (on b29 b137)
    (on-table b137)
    (clear b42)
    (on-table b42)
    (clear b189)
    (on b189 b236)
    (on b236 b138)
    (on b138 b246)
    (on b246 b296)
    (on b296 b211)
    (on b211 b97)
    (on b97 b273)
    (on-table b273)
    (clear b7)
    (on b7 b183)
    (on-table b183)
    (clear b234)
    (on b234 b222)
    (on b222 b126)
    (on b126 b37)
    (on b37 b317)
    (on b317 b171)
    (on-table b171)
    (clear b326)
    (on-table b326)
    (clear b123)
    (on b123 b336)
    (on-table b336)
    (clear b85)
    (on-table b85)
    (clear b31)
    (on-table b31)
    (clear b253)
    (on-table b253)
    (clear b28)
    (on b28 b250)
    (on b250 b62)
    (on b62 b88)
    (on-table b88)
    (clear b292)
    (on b292 b225)
    (on b225 b86)
    (on b86 b307)
    (on-table b307)
    (clear b24)
    (on b24 b230)
    (on b230 b91)
    (on b91 b241)
    (on b241 b324)
    (on b324 b271)
    (on b271 b4)
    (on b4 b282)
    (on b282 b164)
    (on b164 b297)
    (on b297 b301)
    (on b301 b35)
    (on b35 b205)
    (on b205 b106)
    (on-table b106)
    (clear b247)
    (on b247 b190)
    (on-table b190)
    (clear b332)
    (on b332 b255)
    (on b255 b142)
    (on-table b142)
    (clear b200)
    (on b200 b254)
    (on-table b254)
    (clear b257)
    (on-table b257)
    (clear b3)
    (on b3 b210)
    (on b210 b14)
    (on b14 b150)
    (on b150 b302)
    (on b302 b128)
    (on-table b128)
    (clear b110)
    (on b110 b219)
    (on b219 b8)
    (on b8 b195)
    (on-table b195)
    (clear b2)
    (on b2 b95)
    (on b95 b259)
    (on b259 b315)
    (on b315 b178)
    (on b178 b204)
    (on b204 b308)
    (on b308 b96)
    (on b96 b122)
    (on b122 b84)
    (on b84 b209)
    (on b209 b213)
    (on b213 b312)
    (on-table b312)
    (clear b80)
    (on-table b80)
    (clear b243)
    (on b243 b321)
    (on b321 b286)
    (on b286 b272)
    (on b272 b33)
    (on-table b33)
    (clear b231)
    (on b231 b101)
    (on b101 b120)
    (on-table b120)
    (clear b298)
    (on b298 b133)
    (on b133 b161)
    (on-table b161)
    (clear b229)
    (on b229 b18)
    (on-table b18)
    (clear b186)
    (on-table b186)
    (clear b188)
    (on-table b188)
    (clear b278)
    (on-table b278)
    (clear b299)
    (on b299 b256)
    (on b256 b16)
    (on b16 b21)
    (on b21 b141)
    (on b141 b148)
    (on b148 b251)
    (on b251 b173)
    (on b173 b54)
    (on b54 b139)
    (on b139 b283)
    (on b283 b314)
    (on-table b314)
    (clear b281)
    (on b281 b41)
    (on b41 b245)
    (on b245 b185)
    (on b185 b131)
    (on b131 b198)
    (on b198 b114)
    (on b114 b22)
    (on b22 b82)
    (on-table b82)
    (clear b89)
    (on b89 b1)
    (on b1 b83)
    (on b83 b191)
    (on-table b191)
    (clear b248)
    (on b248 b208)
    (on b208 b175)
    (on b175 b289)
    (on b289 b50)
    (on-table b50)
    (clear b38)
    (on b38 b216)
    (on b216 b291)
    (on b291 b235)
    (on-table b235)
    (clear b153)
    (on b153 b303)
    (on b303 b320)
    (on-table b320)
    (clear b64)
    (on b64 b179)
    (on-table b179)
    (clear b154)
    (on b154 b115)
    (on-table b115)
    (clear b27)
    (on-table b27)
    (clear b32)
    (on-table b32)
    (clear b48)
    (on b48 b306)
    (on-table b306)
    (clear b242)
    (on b242 b90)
    (on b90 b170)
    (on b170 b47)
    (on b47 b15)
    (on-table b15)
    (clear b57)
    (on b57 b277)
    (on b277 b305)
    (on b305 b300)
    (on b300 b63)
    (on b63 b201)
    (on b201 b180)
    (on b180 b135)
    (on b135 b258)
    (on b258 b26)
    (on b26 b43)
    (on b43 b99)
    (on-table b99)
    (clear b249)
    (on b249 b187)
    (on b187 b117)
    (on-table b117)
    (clear b206)
    (on-table b206)
    (clear b275)
    (on b275 b149)
    (on b149 b92)
    (on-table b92)
    (clear b227)
    (on b227 b232)
    (on b232 b328)
    (on b328 b159)
    (on b159 b276)
    (on b276 b66)
    (on b66 b23)
    (on b23 b72)
    (on b72 b239)
    (on b239 b100)
    (on b100 b237)
    (on b237 b319)
    (on b319 b156)
    (on b156 b223)
    (on-table b223)
    (clear b318)
    (on b318 b130)
    (on b130 b268)
    (on b268 b224)
    (on b224 b215)
    (on b215 b267)
    (on b267 b192)
    (on b192 b59)
    (on b59 b77)
    (on b77 b233)
    (on b233 b196)
    (on b196 b60)
    (on b60 b265)
    (on b265 b127)
    (on-table b127)
    (clear b193)
    (on b193 b118)
    (on b118 b13)
    (on-table b13)
    (clear b226)
    (on b226 b327)
    (on b327 b93)
    (on b93 b181)
    (on b181 b6)
    (on b6 b103)
    (on b103 b240)
    (on b240 b244)
    (on-table b244)
    (clear b61)
    (on-table b61)
    (clear b316)
    (on b316 b177)
    (on b177 b203)
    (on b203 b5)
    (on b5 b165)
    (on b165 b87)
    (on b87 b58)
    (on-table b58)
    (clear b280)
    (on b280 b323)
    (on b323 b67)
    (on b67 b71)
    (on b71 b166)
    (on b166 b294)
    (on-table b294)
    (clear b19)
    (on b19 b20)
    (on b20 b252)
    (on b252 b55)
    (on-table b55)
    (clear b163)
    (on b163 b158)
    (on b158 b194)
    (on b194 b119)
    (on-table b119)
    (clear b49)
    (on b49 b36)
    (on b36 b284)
    (on b284 b76)
    (on-table b76)
    (clear b146)
    (on b146 b34)
    (on b34 b266)
    (on b266 b269)
    (on b269 b217)
    (on b217 b70)
    (on b70 b288)
    (on b288 b331)
    (on b331 b52)
    (on b52 b75)
    (on b75 b263)
    (on b263 b68)
    (on b68 b111)
    (on b111 b44)
    (on b44 b228)
    (on-table b228)
    (clear b199)
    (on b199 b65)
    (on b65 b12)
    (on-table b12)
    (clear b169)
    (on b169 b162)
    (on b162 b94)
    (on b94 b287)
    (on b287 b143)
    (on b143 b172)
    (on-table b172)
    (clear b113)
    (on b113 b334)
    (on b334 b46)
    (on b46 b207)
    (on b207 b136)
    (on-table b136)
    (clear b112)
    (on b112 b152)
    (on b152 b105)
    (on b105 b39)
    (on b39 b260)
    (on-table b260)
    (clear b30)
    (on b30 b184)
    (on b184 b290)
    (on b290 b144)
    (on-table b144)
    (clear b176)
    (on-table b176)
    (clear b264)
    (on-table b264)
    (clear b335)
    (on b335 b197)
    (on b197 b330)
    (on b330 b17)
    (on-table b17)
    (clear b151)
    (on b151 b270)
    (on b270 b304)
    (on b304 b182)
    (on-table b182)
    (clear b333)
    (on b333 b157)
    (on b157 b140)
    (on b140 b238)
    (on-table b238)
    (clear b310)
    (on b310 b147)
    (on b147 b56)
    (on b56 b129)
    (on b129 b98)
    (on-table b98)
    (clear b174)
    (on b174 b108)
    (on-table b108)
    (clear b116)
    (on b116 b73)
    (on-table b73)
    (clear b40)
    (on b40 b202)
    (on b202 b261)
    (on b261 b132)
    (on b132 b220)
    (on-table b220)
    (clear b78)
    (on-table b78)
    (clear b81)
    (on b81 b214)
    (on b214 b11)
    (on b11 b45)
    (on b45 b102)
    (on b102 b285)
    (on b285 b293)
    (on b293 b134)
    (on-table b134)
    (clear b295)
    (on b295 b74)
    (on-table b74)
    (clear b79)
    (on-table b79)
    (clear b109)
    (on b109 b221)
    (on b221 b107)
    (on b107 b124)
    (on b124 b309)
    (on b309 b69)
    (on b69 b25)
    (on b25 b155)
    (on-table b155)
    (clear b9)
    (on b9 b167)
    (on b167 b121)
    (on b121 b104)
    (on b104 b262)
    (on-table b262)
    (clear b218)
    (on-table b218)
    (clear b274)
    (on b274 b160)
    (on b160 b145)
    (on b145 b322)
    (on b322 b329)
    (on b329 b51)
    (on-table b51)
    (clear b10)
    (on-table b10))
 (:goal  (and 
    (clear b8)
    (on b8 b9)
    (on b9 b10)
    (on b10 b3)
    (on b3 b4)
    (on b4 b1)
    (on b1 b2)
    (on b2 b7)
    (on b7 b5)
    (on b5 b6)
    (on-table b6))))

; plan
1. (unstack b110 b219)
   deleted: (on b110 b219) (clear b110) (arm-empty)
   added: (holding b110) (clear b219)
   goals met: 0 of 11
2. (putdown b110)
   deleted: (holding b110)
   added: (clear b110) (arm-empty) (on-table b110)
   goals met: 0 of 11
3. (unstack b219 b8)
   deleted: (on b219 b8) (clear b219) (arm-empty)
   added: (holding b219) (clear b8)
   goals met: 1 of 11
4. (putdown b219)
   deleted: (holding b219)
   added: (clear b219) (arm-empty) (on-table b219)
   goals met: 1 of 11
5. (unstack b226 b327)
   deleted: (on b226 b327) (clear b226) (arm-empty)
   added: (holding b226) (clear b327)
   goals met: 1 of 11
6. (putdown b226)
   deleted: (holding b226)
   added: (clear b226) (arm-empty) (on-table b226)
   goals met: 1 of 11
7. (unstack b24 b230)
   deleted: (on b24 b230) (clear b24) (arm-empty)
   added: (holding b24) (clear b230)
   goals met: 1 of 11
8. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 1 of 11
9. (unstack b230 b91)
   deleted: (on b230 b91) (clear b230) (arm-empty)
   added: (holding b230) (clear b91)
   goals met: 1 of 11
10. (putdown b230)
   deleted: (holding b230)
   added: (clear b230) (arm-empty) (on-table b230)
   goals met: 1 of 11
11. (unstack b316 b177)
   deleted: (on b316 b177) (clear b316) (arm-empty)
   added: (holding b316) (clear b177)
   goals met: 1 of 11
12. (putdown b316)
   deleted: (holding b316)
   added: (clear b316) (arm-empty) (on-table b316)
   goals met: 1 of 11
13. (unstack b177 b203)
   deleted: (on b177 b203) (clear b177) (arm-empty)
   added: (holding b177) (clear b203)
   goals met: 1 of 11
14. (putdown b177)
   deleted: (holding b177)
   added: (clear b177) (arm-empty) (on-table b177)
   goals met: 1 of 11
15. (unstack b203 b5)
   deleted: (on b203 b5) (clear b203) (arm-empty)
   added: (holding b203) (clear b5)
   goals met: 1 of 11
16. (putdown b203)
   deleted: (holding b203)
   added: (clear b203) (arm-empty) (on-table b203)
   goals met: 1 of 11
17. (unstack b327 b93)
   deleted: (on b327 b93) (clear b327) (arm-empty)
   added: (holding b327) (clear b93)
   goals met: 1 of 11
18. (putdown b327)
   deleted: (holding b327)
   added: (clear b327) (arm-empty) (on-table b327)
   goals met: 1 of 11
19. (unstack b89 b1)
   deleted: (on b89 b1) (clear b89) (arm-empty)
   added: (holding b89) (clear b1)
   goals met: 1 of 11
20. (putdown b89)
   deleted: (holding b89)
   added: (clear b89) (arm-empty) (on-table b89)
   goals met: 1 of 11
21. (unstack b91 b241)
   deleted: (on b91 b241) (clear b91) (arm-empty)
   added: (holding b91) (clear b241)
   goals met: 1 of 11
22. (putdown b91)
   deleted: (holding b91)
   added: (clear b91) (arm-empty) (on-table b91)
   goals met: 1 of 11
23. (unstack b241 b324)
   deleted: (on b241 b324) (clear b241) (arm-empty)
   added: (holding b241) (clear b324)
   goals met: 1 of 11
24. (putdown b241)
   deleted: (holding b241)
   added: (clear b241) (arm-empty) (on-table b241)
   goals met: 1 of 11
25. (unstack b324 b271)
   deleted: (on b324 b271) (clear b324) (arm-empty)
   added: (holding b324) (clear b271)
   goals met: 1 of 11
26. (putdown b324)
   deleted: (holding b324)
   added: (clear b324) (arm-empty) (on-table b324)
   goals met: 1 of 11
27. (unstack b271 b4)
   deleted: (on b271 b4) (clear b271) (arm-empty)
   added: (holding b271) (clear b4)
   goals met: 1 of 11
28. (putdown b271)
   deleted: (holding b271)
   added: (clear b271) (arm-empty) (on-table b271)
   goals met: 1 of 11
29. (unstack b93 b181)
   deleted: (on b93 b181) (clear b93) (arm-empty)
   added: (holding b93) (clear b181)
   goals met: 1 of 11
30. (putdown b93)
   deleted: (holding b93)
   added: (clear b93) (arm-empty) (on-table b93)
   goals met: 1 of 11
31. (unstack b181 b6)
   deleted: (on b181 b6) (clear b181) (arm-empty)
   added: (holding b181) (clear b6)
   goals met: 1 of 11
32. (putdown b181)
   deleted: (holding b181)
   added: (clear b181) (arm-empty) (on-table b181)
   goals met: 1 of 11
33. (unstack b6 b103)
   deleted: (on b6 b103) (clear b6) (arm-empty)
   added: (holding b6) (clear b103)
   goals met: 1 of 11
34. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 2 of 11
35. (pickup b10)
   deleted: (clear b10) (on-table b10) (arm-empty)
   added: (holding b10)
   goals met: 2 of 11
36. (stack b10 b3)
   deleted: (clear b3) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b3)
   goals met: 3 of 11
37. (unstack b1 b83)
   deleted: (on b1 b83) (clear b1) (arm-empty)
   added: (holding b1) (clear b83)
   goals met: 3 of 11
38. (stack b1 b2)
   deleted: (clear b2) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b2)
   goals met: 4 of 11
39. (unstack b4 b282)
   deleted: (on b4 b282) (clear b4) (arm-empty)
   added: (holding b4) (clear b282)
   goals met: 4 of 11
40. (stack b4 b1)
   deleted: (clear b1) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b1)
   goals met: 5 of 11
41. (unstack b5 b165)
   deleted: (on b5 b165) (clear b5) (arm-empty)
   added: (holding b5) (clear b165)
   goals met: 5 of 11
42. (stack b5 b6)
   deleted: (clear b6) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b6)
   goals met: 6 of 11
43. (unstack b7 b183)
   deleted: (on b7 b183) (clear b7) (arm-empty)
   added: (holding b7) (clear b183)
   goals met: 6 of 11
44. (stack b7 b5)
   deleted: (clear b5) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b5)
   goals met: 7 of 11
45. (unstack b10 b3)
   deleted: (on b10 b3) (clear b10) (arm-empty)
   added: (holding b10) (clear b3)
   goals met: 6 of 11
46. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 6 of 11
47. (unstack b4 b1)
   deleted: (on b4 b1) (clear b4) (arm-empty)
   added: (holding b4) (clear b1)
   goals met: 5 of 11
48. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 5 of 11
49. (unstack b1 b2)
   deleted: (on b1 b2) (clear b1) (arm-empty)
   added: (holding b1) (clear b2)
   goals met: 4 of 11
50. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 4 of 11
51. (unstack b2 b95)
   deleted: (on b2 b95) (clear b2) (arm-empty)
   added: (holding b2) (clear b95)
   goals met: 4 of 11
52. (stack b2 b7)
   deleted: (clear b7) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b7)
   goals met: 5 of 11
53. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 5 of 11
54. (stack b1 b2)
   deleted: (clear b2) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b2)
   goals met: 6 of 11
55. (pickup b10)
   deleted: (clear b10) (on-table b10) (arm-empty)
   added: (holding b10)
   goals met: 6 of 11
56. (stack b10 b3)
   deleted: (clear b3) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b3)
   goals met: 7 of 11
57. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 7 of 11
58. (stack b4 b1)
   deleted: (clear b1) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b1)
   goals met: 8 of 11
59. (unstack b10 b3)
   deleted: (on b10 b3) (clear b10) (arm-empty)
   added: (holding b10) (clear b3)
   goals met: 7 of 11
60. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 7 of 11
61. (unstack b3 b210)
   deleted: (on b3 b210) (clear b3) (arm-empty)
   added: (holding b3) (clear b210)
   goals met: 7 of 11
62. (stack b3 b4)
   deleted: (clear b4) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b4)
   goals met: 8 of 11
63. (pickup b10)
   deleted: (clear b10) (on-table b10) (arm-empty)
   added: (holding b10)
   goals met: 8 of 11
64. (stack b10 b3)
   deleted: (clear b3) (holding b10)
   added: (arm-empty) (clear b10) (on b10 b3)
   goals met: 9 of 11
65. (unstack b9 b167)
   deleted: (on b9 b167) (clear b9) (arm-empty)
   added: (holding b9) (clear b167)
   goals met: 9 of 11
66. (stack b9 b10)
   deleted: (clear b10) (holding b9)
   added: (arm-empty) (clear b9) (on b9 b10)
   goals met: 10 of 11
67. (unstack b8 b195)
   deleted: (on b8 b195) (clear b8) (arm-empty)
   added: (holding b8) (clear b195)
   goals met: 9 of 11
68. (stack b8 b9)
   deleted: (clear b9) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b9)
   goals met: 11 of 11
